In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.1.3
1.20.2

Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 2
cols = ['omset', 'operasional']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)

df

   omset  operasional
0     19            6
1     16           19
2     17           18
3     11            8
4      9           10

In [3]:
df['omset'] = df['omset'] * 100_000
df['operasional'] = df['operasional'] * 10_000
df

     omset  operasional
0  1900000        60000
1  1600000       190000
2  1700000       180000
3  1100000        80000
4   900000       100000

In [7]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

     tanggal    omset  operasional
0 2000-01-01  1900000        60000
1 2000-01-02  1600000       190000
2 2000-01-03  1700000       180000
3 2000-01-04  1100000        80000
4 2000-01-05   900000       100000

Melakukan formatting tampilan Data Frame

In [16]:
formatku = {'tanggal':'{:%d/%m/%Y}',
           'operasional':'Rp {:.2f}', 
            'omset':'Rp {:.2f}'}

laporan = df.style.format(formatku)
laporan